#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; NORMAL                   0   xyz         1     NONE   float   xyz 
; COLOR                    0   xyzw        2     NONE   float   xyzw
; TEXCOORD                 0   xy          3     NONE   float   xy  
; TEXCOORD                 1   xy          4     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; TEXCOORD                 1     z         2     NONE   float     z 
;
; shader debug name: ca5412d028257be9a6de204b0939db7f.pdb
; shader hash: ca5412d028257be9a6de204b0939db7f
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 5
; SigOutputElements: 4
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 5
; SigOutputVectors[0]: 3
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !39, globals: !63)
!1 = !DIFile(filename: "Shaders\5CLandscapeVS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !31}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 19, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 19, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 19, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 35, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 35, size: 288, align: 32, elements: !18, templateParams: !28)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !17, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!28 = !{!13, !29, !30}
!29 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!30 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 35, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 35, size: 96, align: 32, elements: !33, templateParams: !37)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 35, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !{!13, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!39 = !{!40}
!40 = !DISubprogram(name: "main", scope: !1, file: !1, line: 23, type: !41, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !56}
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 15, size: 352, align: 32, elements: !44)
!44 = !{!45, !46, !47, !55}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !43, file: !1, line: 17, baseType: !4, size: 128, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !43, file: !1, line: 18, baseType: !4, size: 128, align: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord0", scope: !43, file: !1, line: 19, baseType: !48, size: 64, align: 32, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 67, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 67, size: 64, align: 32, elements: !50, templateParams: !53)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !49, file: !1, line: 67, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !49, file: !1, line: 67, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !{!13, !54}
!54 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "FogFactor", scope: !43, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 320)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 6, size: 448, align: 32, elements: !57)
!57 = !{!58, !59, !60, !61, !62}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !56, file: !1, line: 8, baseType: !31, size: 96, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !56, file: !1, line: 9, baseType: !31, size: 96, align: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !56, file: !1, line: 10, baseType: !4, size: 128, align: 32, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord0", scope: !56, file: !1, line: 11, baseType: !48, size: 64, align: 32, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord1", scope: !56, file: !1, line: 12, baseType: !48, size: 64, align: 32, offset: 384)
!63 = !{!64, !67, !68, !70, !71, !72, !76, !77, !87, !111, !112, !126, !127, !128, !129, !130, !131, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147}
!64 = !DIGlobalVariable(name: "GlobalAmbient", linkageName: "\01?GlobalAmbient@SceneConstants@@3V?$vector@M$03@@B", scope: !0, file: !65, line: 19, type: !66, isLocal: false, isDefinition: true)
!65 = !DIFile(filename: "Shaders/PerFrameConstants.hlsli", directory: "")
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!67 = !DIGlobalVariable(name: "FogColor", linkageName: "\01?FogColor@SceneConstants@@3V?$vector@M$03@@B", scope: !0, file: !65, line: 20, type: !66, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariable(name: "FogStart", linkageName: "\01?FogStart@SceneConstants@@3MB", scope: !0, file: !65, line: 21, type: !69, isLocal: false, isDefinition: true)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!70 = !DIGlobalVariable(name: "FogEnd", linkageName: "\01?FogEnd@SceneConstants@@3MB", scope: !0, file: !65, line: 22, type: !69, isLocal: false, isDefinition: true)
!71 = !DIGlobalVariable(name: "FogDensity", linkageName: "\01?FogDensity@SceneConstants@@3MB", scope: !0, file: !65, line: 23, type: !69, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariable(name: "FogMode", linkageName: "\01?FogMode@SceneConstants@@3IB", scope: !0, file: !65, line: 24, type: !73, isLocal: false, isDefinition: true)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 24, baseType: !75)
!75 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!76 = !DIGlobalVariable(name: "FadeAlpha", linkageName: "\01?FadeAlpha@SceneConstants@@3MB", scope: !0, file: !65, line: 25, type: !69, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariable(name: "_scenePad", linkageName: "\01?_scenePad@SceneConstants@@3V?$vector@I$02@@B", scope: !0, file: !65, line: 26, type: !78, isLocal: false, isDefinition: true)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 26, baseType: !80)
!80 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 26, size: 96, align: 32, elements: !81, templateParams: !85)
!81 = !{!82, !83, !84}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !80, file: !1, line: 26, baseType: !75, size: 32, align: 32, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !80, file: !1, line: 26, baseType: !75, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !80, file: !1, line: 26, baseType: !75, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!85 = !{!86, !38}
!86 = !DITemplateTypeParameter(name: "element", type: !75)
!87 = !DIGlobalVariable(name: "WorldMatrix", linkageName: "\01?WorldMatrix@DrawConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !65, line: 32, type: !88, isLocal: false, isDefinition: true)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 32, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 32, size: 512, align: 32, elements: !91, templateParams: !108)
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !90, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!108 = !{!13, !109, !110}
!109 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!110 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!111 = !DIGlobalVariable(name: "ProjectionMatrix", linkageName: "\01?ProjectionMatrix@DrawConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !65, line: 33, type: !88, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariable(name: "Lights", linkageName: "\01?Lights@DrawConstants@@3QBULightData@@B", scope: !0, file: !65, line: 35, type: !113, isLocal: false, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 6144, align: 32, elements: !124)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "LightData", file: !65, line: 5, size: 768, align: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !115, file: !65, line: 7, baseType: !4, size: 128, align: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !115, file: !65, line: 8, baseType: !4, size: 128, align: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !115, file: !65, line: 9, baseType: !4, size: 128, align: 32, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !115, file: !65, line: 10, baseType: !4, size: 128, align: 32, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !115, file: !65, line: 11, baseType: !4, size: 128, align: 32, offset: 512)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", scope: !115, file: !65, line: 12, baseType: !74, size: 32, align: 32, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !115, file: !65, line: 13, baseType: !31, size: 96, align: 32, offset: 672)
!124 = !{!125}
!125 = !DISubrange(count: 8)
!126 = !DIGlobalVariable(name: "MatAmbient", linkageName: "\01?MatAmbient@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !65, line: 38, type: !66, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariable(name: "MatDiffuse", linkageName: "\01?MatDiffuse@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !65, line: 39, type: !66, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariable(name: "MatSpecular", linkageName: "\01?MatSpecular@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !65, line: 40, type: !66, isLocal: false, isDefinition: true)
!129 = !DIGlobalVariable(name: "MatEmissive", linkageName: "\01?MatEmissive@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !65, line: 41, type: !66, isLocal: false, isDefinition: true)
!130 = !DIGlobalVariable(name: "MatShininess", linkageName: "\01?MatShininess@DrawConstants@@3MB", scope: !0, file: !65, line: 42, type: !69, isLocal: false, isDefinition: true)
!131 = !DIGlobalVariable(name: "_matPad", linkageName: "\01?_matPad@DrawConstants@@3V?$vector@M$02@@B", scope: !0, file: !65, line: 43, type: !132, isLocal: false, isDefinition: true)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!133 = !DIGlobalVariable(name: "LightingEnabled", linkageName: "\01?LightingEnabled@DrawConstants@@3IB", scope: !0, file: !65, line: 45, type: !73, isLocal: false, isDefinition: true)
!134 = !DIGlobalVariable(name: "FogEnabled", linkageName: "\01?FogEnabled@DrawConstants@@3IB", scope: !0, file: !65, line: 46, type: !73, isLocal: false, isDefinition: true)
!135 = !DIGlobalVariable(name: "TexturingEnabled0", linkageName: "\01?TexturingEnabled0@DrawConstants@@3IB", scope: !0, file: !65, line: 47, type: !73, isLocal: false, isDefinition: true)
!136 = !DIGlobalVariable(name: "TexturingEnabled1", linkageName: "\01?TexturingEnabled1@DrawConstants@@3IB", scope: !0, file: !65, line: 48, type: !73, isLocal: false, isDefinition: true)
!137 = !DIGlobalVariable(name: "TexEnvMode0", linkageName: "\01?TexEnvMode0@DrawConstants@@3IB", scope: !0, file: !65, line: 51, type: !73, isLocal: false, isDefinition: true)
!138 = !DIGlobalVariable(name: "TexEnvMode1", linkageName: "\01?TexEnvMode1@DrawConstants@@3IB", scope: !0, file: !65, line: 52, type: !73, isLocal: false, isDefinition: true)
!139 = !DIGlobalVariable(name: "ColorMaterialEnabled", linkageName: "\01?ColorMaterialEnabled@DrawConstants@@3IB", scope: !0, file: !65, line: 55, type: !73, isLocal: false, isDefinition: true)
!140 = !DIGlobalVariable(name: "ColorMaterialMode", linkageName: "\01?ColorMaterialMode@DrawConstants@@3IB", scope: !0, file: !65, line: 56, type: !73, isLocal: false, isDefinition: true)
!141 = !DIGlobalVariable(name: "AlphaTestEnabled", linkageName: "\01?AlphaTestEnabled@DrawConstants@@3IB", scope: !0, file: !65, line: 59, type: !73, isLocal: false, isDefinition: true)
!142 = !DIGlobalVariable(name: "AlphaTestFunc", linkageName: "\01?AlphaTestFunc@DrawConstants@@3IB", scope: !0, file: !65, line: 60, type: !73, isLocal: false, isDefinition: true)
!143 = !DIGlobalVariable(name: "AlphaTestRef", linkageName: "\01?AlphaTestRef@DrawConstants@@3MB", scope: !0, file: !65, line: 61, type: !69, isLocal: false, isDefinition: true)
!144 = !DIGlobalVariable(name: "NormalizeNormals", linkageName: "\01?NormalizeNormals@DrawConstants@@3IB", scope: !0, file: !65, line: 64, type: !73, isLocal: false, isDefinition: true)
!145 = !DIGlobalVariable(name: "FlatShading", linkageName: "\01?FlatShading@DrawConstants@@3IB", scope: !0, file: !65, line: 65, type: !73, isLocal: false, isDefinition: true)
!146 = !DIGlobalVariable(name: "PointSize", linkageName: "\01?PointSize@DrawConstants@@3MB", scope: !0, file: !65, line: 66, type: !69, isLocal: false, isDefinition: true)
