#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; TEXCOORD                 1     zw        2     NONE   float     zw
; TEXCOORD                 2   x           3     NONE   float   x   
; TEXCOORD                 3    yzw        3     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: ab701eeae502505d37646f192700b625.pdb
; shader hash: ab701eeae502505d37646f192700b625
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 6
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 4
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !48)
!1 = !DIFile(filename: "Shaders\5CPixelShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 18, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 18, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !43}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 90, type: !18, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !20}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 70, size: 512, align: 32, elements: !21)
!21 = !{!22, !23, !24, !32, !33, !34}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 72, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !20, file: !1, line: 73, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord0", scope: !20, file: !1, line: 74, baseType: !25, size: 64, align: 32, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 52, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 52, size: 64, align: 32, elements: !27, templateParams: !30)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 52, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 52, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord1", scope: !20, file: !1, line: 75, baseType: !25, size: 64, align: 32, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "FogDist", scope: !20, file: !1, line: 76, baseType: !8, size: 32, align: 32, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "WorldPos", scope: !20, file: !1, line: 77, baseType: !35, size: 96, align: 32, offset: 416)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 18, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 18, size: 96, align: 32, elements: !37, templateParams: !41)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!41 = !{!13, !42}
!42 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!43 = !DISubprogram(name: "ApplyTexEnv", linkageName: "\01?ApplyTexEnv@@YA?AV?$vector@M$03@@V1@0I@Z", scope: !1, file: !1, line: 80, type: !44, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false)
!44 = !DISubroutineType(types: !45)
!45 = !{!4, !4, !4, !46}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 18, baseType: !47)
!47 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!48 = !{!49, !73, !74, !88, !90, !91, !92, !93, !95, !97, !98, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !123, !124, !126}
!49 = !DIGlobalVariable(name: "WorldMatrix", linkageName: "\01?WorldMatrix@PerFrameConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 5, type: !50, isLocal: false, isDefinition: true)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 5, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 5, size: 512, align: 32, elements: !53, templateParams: !70)
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !52, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!70 = !{!13, !71, !72}
!71 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!72 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!73 = !DIGlobalVariable(name: "ProjectionMatrix", linkageName: "\01?ProjectionMatrix@PerFrameConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 6, type: !50, isLocal: false, isDefinition: true)
!74 = !DIGlobalVariable(name: "Lights", linkageName: "\01?Lights@PerFrameConstants@@3QBULightData@1@B", scope: !0, file: !1, line: 18, type: !75, isLocal: false, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 6144, align: 32, elements: !86)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "LightData", file: !1, line: 8, size: 768, align: 32, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84, !85}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !77, file: !1, line: 10, baseType: !4, size: 128, align: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !77, file: !1, line: 11, baseType: !4, size: 128, align: 32, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !77, file: !1, line: 12, baseType: !4, size: 128, align: 32, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !77, file: !1, line: 13, baseType: !4, size: 128, align: 32, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !77, file: !1, line: 14, baseType: !4, size: 128, align: 32, offset: 512)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", scope: !77, file: !1, line: 15, baseType: !46, size: 32, align: 32, offset: 640)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !77, file: !1, line: 16, baseType: !35, size: 96, align: 32, offset: 672)
!86 = !{!87}
!87 = !DISubrange(count: 8)
!88 = !DIGlobalVariable(name: "MatAmbient", linkageName: "\01?MatAmbient@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 20, type: !89, isLocal: false, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!90 = !DIGlobalVariable(name: "MatDiffuse", linkageName: "\01?MatDiffuse@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 21, type: !89, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariable(name: "MatSpecular", linkageName: "\01?MatSpecular@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 22, type: !89, isLocal: false, isDefinition: true)
!92 = !DIGlobalVariable(name: "MatEmissive", linkageName: "\01?MatEmissive@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 23, type: !89, isLocal: false, isDefinition: true)
!93 = !DIGlobalVariable(name: "MatShininess", linkageName: "\01?MatShininess@PerFrameConstants@@3MB", scope: !0, file: !1, line: 24, type: !94, isLocal: false, isDefinition: true)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!95 = !DIGlobalVariable(name: "_matPad", linkageName: "\01?_matPad@PerFrameConstants@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 25, type: !96, isLocal: false, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!97 = !DIGlobalVariable(name: "GlobalAmbient", linkageName: "\01?GlobalAmbient@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 27, type: !89, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariable(name: "LightingEnabled", linkageName: "\01?LightingEnabled@PerFrameConstants@@3IB", scope: !0, file: !1, line: 28, type: !99, isLocal: false, isDefinition: true)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!100 = !DIGlobalVariable(name: "FogEnabled", linkageName: "\01?FogEnabled@PerFrameConstants@@3IB", scope: !0, file: !1, line: 29, type: !99, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariable(name: "TexturingEnabled0", linkageName: "\01?TexturingEnabled0@PerFrameConstants@@3IB", scope: !0, file: !1, line: 30, type: !99, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariable(name: "TexturingEnabled1", linkageName: "\01?TexturingEnabled1@PerFrameConstants@@3IB", scope: !0, file: !1, line: 31, type: !99, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariable(name: "FogColor", linkageName: "\01?FogColor@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !1, line: 33, type: !89, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "FogStart", linkageName: "\01?FogStart@PerFrameConstants@@3MB", scope: !0, file: !1, line: 34, type: !94, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariable(name: "FogEnd", linkageName: "\01?FogEnd@PerFrameConstants@@3MB", scope: !0, file: !1, line: 35, type: !94, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariable(name: "FogDensity", linkageName: "\01?FogDensity@PerFrameConstants@@3MB", scope: !0, file: !1, line: 36, type: !94, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariable(name: "FogMode", linkageName: "\01?FogMode@PerFrameConstants@@3IB", scope: !0, file: !1, line: 37, type: !99, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariable(name: "TexEnvMode0", linkageName: "\01?TexEnvMode0@PerFrameConstants@@3IB", scope: !0, file: !1, line: 39, type: !99, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariable(name: "TexEnvMode1", linkageName: "\01?TexEnvMode1@PerFrameConstants@@3IB", scope: !0, file: !1, line: 40, type: !99, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariable(name: "ColorMaterialEnabled", linkageName: "\01?ColorMaterialEnabled@PerFrameConstants@@3IB", scope: !0, file: !1, line: 42, type: !99, isLocal: false, isDefinition: true)
