#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; TEXCOORD                 1     zw        2     NONE   float     zw
; TEXCOORD                 2   x           3     NONE   float   x   
; TEXCOORD                 3    yzw        3     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: e31b258293f351f27ead57408e901234.pdb
; shader hash: e31b258293f351f27ead57408e901234
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 6
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 4
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !48)
!1 = !DIFile(filename: "Shaders\5CPixelShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 19, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 19, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 19, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !43}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 40, type: !18, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !20}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 20, size: 512, align: 32, elements: !21)
!21 = !{!22, !23, !24, !32, !33, !34}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 22, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !20, file: !1, line: 23, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord0", scope: !20, file: !1, line: 24, baseType: !25, size: 64, align: 32, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 67, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 67, size: 64, align: 32, elements: !27, templateParams: !30)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 67, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 67, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord1", scope: !20, file: !1, line: 25, baseType: !25, size: 64, align: 32, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "FogDist", scope: !20, file: !1, line: 26, baseType: !8, size: 32, align: 32, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "WorldPos", scope: !20, file: !1, line: 27, baseType: !35, size: 96, align: 32, offset: 416)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 35, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 35, size: 96, align: 32, elements: !37, templateParams: !41)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, line: 35, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!41 = !{!13, !42}
!42 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!43 = !DISubprogram(name: "ApplyTexEnv", linkageName: "\01?ApplyTexEnv@@YA?AV?$vector@M$03@@V1@0I@Z", scope: !1, file: !1, line: 30, type: !44, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false)
!44 = !DISubroutineType(types: !45)
!45 = !{!4, !4, !4, !46}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 24, baseType: !47)
!47 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!48 = !{!49, !52, !53, !55, !56, !57, !59, !60, !70, !94, !95, !109, !110, !111, !112, !113, !114, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !135, !136, !138}
!49 = !DIGlobalVariable(name: "GlobalAmbient", linkageName: "\01?GlobalAmbient@SceneConstants@@3V?$vector@M$03@@B", scope: !0, file: !50, line: 19, type: !51, isLocal: false, isDefinition: true)
!50 = !DIFile(filename: "Shaders/PerFrameConstants.hlsli", directory: "")
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!52 = !DIGlobalVariable(name: "FogColor", linkageName: "\01?FogColor@SceneConstants@@3V?$vector@M$03@@B", scope: !0, file: !50, line: 20, type: !51, isLocal: false, isDefinition: true)
!53 = !DIGlobalVariable(name: "FogStart", linkageName: "\01?FogStart@SceneConstants@@3MB", scope: !0, file: !50, line: 21, type: !54, isLocal: false, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!55 = !DIGlobalVariable(name: "FogEnd", linkageName: "\01?FogEnd@SceneConstants@@3MB", scope: !0, file: !50, line: 22, type: !54, isLocal: false, isDefinition: true)
!56 = !DIGlobalVariable(name: "FogDensity", linkageName: "\01?FogDensity@SceneConstants@@3MB", scope: !0, file: !50, line: 23, type: !54, isLocal: false, isDefinition: true)
!57 = !DIGlobalVariable(name: "FogMode", linkageName: "\01?FogMode@SceneConstants@@3IB", scope: !0, file: !50, line: 24, type: !58, isLocal: false, isDefinition: true)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!59 = !DIGlobalVariable(name: "FadeAlpha", linkageName: "\01?FadeAlpha@SceneConstants@@3MB", scope: !0, file: !50, line: 25, type: !54, isLocal: false, isDefinition: true)
!60 = !DIGlobalVariable(name: "_scenePad", linkageName: "\01?_scenePad@SceneConstants@@3V?$vector@I$02@@B", scope: !0, file: !50, line: 26, type: !61, isLocal: false, isDefinition: true)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 26, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 26, size: 96, align: 32, elements: !64, templateParams: !68)
!64 = !{!65, !66, !67}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !63, file: !1, line: 26, baseType: !47, size: 32, align: 32, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !63, file: !1, line: 26, baseType: !47, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !63, file: !1, line: 26, baseType: !47, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!68 = !{!69, !42}
!69 = !DITemplateTypeParameter(name: "element", type: !47)
!70 = !DIGlobalVariable(name: "WorldMatrix", linkageName: "\01?WorldMatrix@DrawConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !50, line: 32, type: !71, isLocal: false, isDefinition: true)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 32, baseType: !73)
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 32, size: 512, align: 32, elements: !74, templateParams: !91)
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !73, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!91 = !{!13, !92, !93}
!92 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!93 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!94 = !DIGlobalVariable(name: "ProjectionMatrix", linkageName: "\01?ProjectionMatrix@DrawConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !50, line: 33, type: !71, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariable(name: "Lights", linkageName: "\01?Lights@DrawConstants@@3QBULightData@@B", scope: !0, file: !50, line: 35, type: !96, isLocal: false, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 6144, align: 32, elements: !107)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "LightData", file: !50, line: 5, size: 768, align: 32, elements: !99)
!99 = !{!100, !101, !102, !103, !104, !105, !106}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !98, file: !50, line: 7, baseType: !4, size: 128, align: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !98, file: !50, line: 8, baseType: !4, size: 128, align: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !98, file: !50, line: 9, baseType: !4, size: 128, align: 32, offset: 256)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !98, file: !50, line: 10, baseType: !4, size: 128, align: 32, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !98, file: !50, line: 11, baseType: !4, size: 128, align: 32, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", scope: !98, file: !50, line: 12, baseType: !46, size: 32, align: 32, offset: 640)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !98, file: !50, line: 13, baseType: !35, size: 96, align: 32, offset: 672)
!107 = !{!108}
!108 = !DISubrange(count: 8)
!109 = !DIGlobalVariable(name: "MatAmbient", linkageName: "\01?MatAmbient@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !50, line: 38, type: !51, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariable(name: "MatDiffuse", linkageName: "\01?MatDiffuse@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !50, line: 39, type: !51, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariable(name: "MatSpecular", linkageName: "\01?MatSpecular@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !50, line: 40, type: !51, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariable(name: "MatEmissive", linkageName: "\01?MatEmissive@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !50, line: 41, type: !51, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariable(name: "MatShininess", linkageName: "\01?MatShininess@DrawConstants@@3MB", scope: !0, file: !50, line: 42, type: !54, isLocal: false, isDefinition: true)
!114 = !DIGlobalVariable(name: "_matPad", linkageName: "\01?_matPad@DrawConstants@@3V?$vector@M$02@@B", scope: !0, file: !50, line: 43, type: !115, isLocal: false, isDefinition: true)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!116 = !DIGlobalVariable(name: "LightingEnabled", linkageName: "\01?LightingEnabled@DrawConstants@@3IB", scope: !0, file: !50, line: 45, type: !58, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariable(name: "FogEnabled", linkageName: "\01?FogEnabled@DrawConstants@@3IB", scope: !0, file: !50, line: 46, type: !58, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariable(name: "TexturingEnabled0", linkageName: "\01?TexturingEnabled0@DrawConstants@@3IB", scope: !0, file: !50, line: 47, type: !58, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariable(name: "TexturingEnabled1", linkageName: "\01?TexturingEnabled1@DrawConstants@@3IB", scope: !0, file: !50, line: 48, type: !58, isLocal: false, isDefinition: true)
!120 = !DIGlobalVariable(name: "TexEnvMode0", linkageName: "\01?TexEnvMode0@DrawConstants@@3IB", scope: !0, file: !50, line: 51, type: !58, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariable(name: "TexEnvMode1", linkageName: "\01?TexEnvMode1@DrawConstants@@3IB", scope: !0, file: !50, line: 52, type: !58, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariable(name: "ColorMaterialEnabled", linkageName: "\01?ColorMaterialEnabled@DrawConstants@@3IB", scope: !0, file: !50, line: 55, type: !58, isLocal: false, isDefinition: true)
!123 = !DIGlobalVariable(name: "ColorMaterialMode", linkageName: "\01?ColorMaterialMode@DrawConstants@@3IB", scope: !0, file: !50, line: 56, type: !58, isLocal: false, isDefinition: true)
!124 = !DIGlobalVariable(name: "AlphaTestEnabled", linkageName: "\01?AlphaTestEnabled@DrawConstants@@3IB", scope: !0, file: !50, line: 59, type: !58, isLocal: false, isDefinition: true)
!125 = !DIGlobalVariable(name: "AlphaTestFunc", linkageName: "\01?AlphaTestFunc@DrawConstants@@3IB", scope: !0, file: !50, line: 60, type: !58, isLocal: false, isDefinition: true)
!126 = !DIGlobalVariable(name: "AlphaTestRef", linkageName: "\01?AlphaTestRef@DrawConstants@@3MB", scope: !0, file: !50, line: 61, type: !54, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariable(name: "NormalizeNormals", linkageName: "\01?NormalizeNormals@DrawConstants@@3IB", scope: !0, file: !50, line: 64, type: !58, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariable(name: "FlatShading", linkageName: "\01?FlatShading@DrawConstants@@3IB", scope: !0, file: !50, line: 65, type: !58, isLocal: false, isDefinition: true)
!129 = !DIGlobalVariable(name: "PointSize", linkageName: "\01?PointSize@DrawConstants@@3MB", scope: !0, file: !50, line: 66, type: !54, isLocal: false, isDefinition: true)
