#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 7c1dd8151a023ebfca446db2c04eb919.pdb
; shader hash: 7c1dd8151a023ebfca446db2c04eb919
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 3
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 3
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       
; TEXCOORD                 0                 linear       
;
; Output signature:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !31)
!1 = !DIFile(filename: "Shaders\5CSpritePixelShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "main", scope: !1, file: !1, line: 18, type: !5, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DISubroutineType(types: !6)
!6 = !{!7, !19}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 19, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 19, size: 128, align: 32, elements: !9, templateParams: !15)
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, line: 19, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, line: 19, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !8, file: !1, line: 19, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !8, file: !1, line: 19, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!15 = !{!16, !17}
!16 = !DITemplateTypeParameter(name: "element", type: !11)
!17 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 4)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 11, size: 320, align: 32, elements: !20)
!20 = !{!21, !22, !23}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !19, file: !1, line: 13, baseType: !7, size: 128, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !19, file: !1, line: 14, baseType: !7, size: 128, align: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !19, file: !1, line: 15, baseType: !24, size: 64, align: 32, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 67, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 67, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 67, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 67, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!16, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 2)
!31 = !{!32, !35, !36, !38, !39, !40, !44, !45, !56, !80, !81, !102, !103, !104, !105, !106, !107, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !128}
!32 = !DIGlobalVariable(name: "GlobalAmbient", linkageName: "\01?GlobalAmbient@SceneConstants@@3V?$vector@M$03@@B", scope: !0, file: !33, line: 19, type: !34, isLocal: false, isDefinition: true)
!33 = !DIFile(filename: "Shaders/PerFrameConstants.hlsli", directory: "")
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!35 = !DIGlobalVariable(name: "FogColor", linkageName: "\01?FogColor@SceneConstants@@3V?$vector@M$03@@B", scope: !0, file: !33, line: 20, type: !34, isLocal: false, isDefinition: true)
!36 = !DIGlobalVariable(name: "FogStart", linkageName: "\01?FogStart@SceneConstants@@3MB", scope: !0, file: !33, line: 21, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!38 = !DIGlobalVariable(name: "FogEnd", linkageName: "\01?FogEnd@SceneConstants@@3MB", scope: !0, file: !33, line: 22, type: !37, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariable(name: "FogDensity", linkageName: "\01?FogDensity@SceneConstants@@3MB", scope: !0, file: !33, line: 23, type: !37, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariable(name: "FogMode", linkageName: "\01?FogMode@SceneConstants@@3IB", scope: !0, file: !33, line: 24, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 24, baseType: !43)
!43 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!44 = !DIGlobalVariable(name: "FadeAlpha", linkageName: "\01?FadeAlpha@SceneConstants@@3MB", scope: !0, file: !33, line: 25, type: !37, isLocal: false, isDefinition: true)
!45 = !DIGlobalVariable(name: "_scenePad", linkageName: "\01?_scenePad@SceneConstants@@3V?$vector@I$02@@B", scope: !0, file: !33, line: 26, type: !46, isLocal: false, isDefinition: true)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 26, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 26, size: 96, align: 32, elements: !49, templateParams: !53)
!49 = !{!50, !51, !52}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !48, file: !1, line: 26, baseType: !43, size: 32, align: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !48, file: !1, line: 26, baseType: !43, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !48, file: !1, line: 26, baseType: !43, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!53 = !{!54, !55}
!54 = !DITemplateTypeParameter(name: "element", type: !43)
!55 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 3)
!56 = !DIGlobalVariable(name: "WorldMatrix", linkageName: "\01?WorldMatrix@DrawConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !33, line: 32, type: !57, isLocal: false, isDefinition: true)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 32, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 32, size: 512, align: 32, elements: !60, templateParams: !77)
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !59, file: !1, line: 32, baseType: !11, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!77 = !{!16, !78, !79}
!78 = !DITemplateValueParameter(name: "row_count", type: !18, value: i32 4)
!79 = !DITemplateValueParameter(name: "col_count", type: !18, value: i32 4)
!80 = !DIGlobalVariable(name: "ProjectionMatrix", linkageName: "\01?ProjectionMatrix@DrawConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !33, line: 33, type: !57, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariable(name: "Lights", linkageName: "\01?Lights@DrawConstants@@3QBULightData@@B", scope: !0, file: !33, line: 35, type: !82, isLocal: false, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 6144, align: 32, elements: !100)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "LightData", file: !33, line: 5, size: 768, align: 32, elements: !85)
!85 = !{!86, !87, !88, !89, !90, !91, !92}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !84, file: !33, line: 7, baseType: !7, size: 128, align: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !84, file: !33, line: 8, baseType: !7, size: 128, align: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !84, file: !33, line: 9, baseType: !7, size: 128, align: 32, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !84, file: !33, line: 10, baseType: !7, size: 128, align: 32, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !84, file: !33, line: 11, baseType: !7, size: 128, align: 32, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", scope: !84, file: !33, line: 12, baseType: !42, size: 32, align: 32, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !84, file: !33, line: 13, baseType: !93, size: 96, align: 32, offset: 672)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 35, baseType: !94)
!94 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 35, size: 96, align: 32, elements: !95, templateParams: !99)
!95 = !{!96, !97, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !94, file: !1, line: 35, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !94, file: !1, line: 35, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !94, file: !1, line: 35, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!99 = !{!16, !55}
!100 = !{!101}
!101 = !DISubrange(count: 8)
!102 = !DIGlobalVariable(name: "MatAmbient", linkageName: "\01?MatAmbient@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !33, line: 38, type: !34, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariable(name: "MatDiffuse", linkageName: "\01?MatDiffuse@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !33, line: 39, type: !34, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "MatSpecular", linkageName: "\01?MatSpecular@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !33, line: 40, type: !34, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariable(name: "MatEmissive", linkageName: "\01?MatEmissive@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !33, line: 41, type: !34, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariable(name: "MatShininess", linkageName: "\01?MatShininess@DrawConstants@@3MB", scope: !0, file: !33, line: 42, type: !37, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariable(name: "_matPad", linkageName: "\01?_matPad@DrawConstants@@3V?$vector@M$02@@B", scope: !0, file: !33, line: 43, type: !108, isLocal: false, isDefinition: true)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!109 = !DIGlobalVariable(name: "LightingEnabled", linkageName: "\01?LightingEnabled@DrawConstants@@3IB", scope: !0, file: !33, line: 45, type: !41, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariable(name: "FogEnabled", linkageName: "\01?FogEnabled@DrawConstants@@3IB", scope: !0, file: !33, line: 46, type: !41, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariable(name: "TexturingEnabled0", linkageName: "\01?TexturingEnabled0@DrawConstants@@3IB", scope: !0, file: !33, line: 47, type: !41, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariable(name: "TexturingEnabled1", linkageName: "\01?TexturingEnabled1@DrawConstants@@3IB", scope: !0, file: !33, line: 48, type: !41, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariable(name: "TexEnvMode0", linkageName: "\01?TexEnvMode0@DrawConstants@@3IB", scope: !0, file: !33, line: 51, type: !41, isLocal: false, isDefinition: true)
!114 = !DIGlobalVariable(name: "TexEnvMode1", linkageName: "\01?TexEnvMode1@DrawConstants@@3IB", scope: !0, file: !33, line: 52, type: !41, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariable(name: "ColorMaterialEnabled", linkageName: "\01?ColorMaterialEnabled@DrawConstants@@3IB", scope: !0, file: !33, line: 55, type: !41, isLocal: false, isDefinition: true)
!116 = !DIGlobalVariable(name: "ColorMaterialMode", linkageName: "\01?ColorMaterialMode@DrawConstants@@3IB", scope: !0, file: !33, line: 56, type: !41, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariable(name: "AlphaTestEnabled", linkageName: "\01?AlphaTestEnabled@DrawConstants@@3IB", scope: !0, file: !33, line: 59, type: !41, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariable(name: "AlphaTestFunc", linkageName: "\01?AlphaTestFunc@DrawConstants@@3IB", scope: !0, file: !33, line: 60, type: !41, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariable(name: "AlphaTestRef", linkageName: "\01?AlphaTestRef@DrawConstants@@3MB", scope: !0, file: !33, line: 61, type: !37, isLocal: false, isDefinition: true)
!120 = !DIGlobalVariable(name: "NormalizeNormals", linkageName: "\01?NormalizeNormals@DrawConstants@@3IB", scope: !0, file: !33, line: 64, type: !41, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariable(name: "FlatShading", linkageName: "\01?FlatShading@DrawConstants@@3IB", scope: !0, file: !33, line: 65, type: !41, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariable(name: "PointSize", linkageName: "\01?PointSize@DrawConstants@@3MB", scope: !0, file: !33, line: 66, type: !37, isLocal: false, isDefinition: true)
