#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xy          0     NONE   float   xy  
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
; shader debug name: f4ecf8045119fa59fa4e309d6fab1997.pdb
; shader hash: f4ecf8045119fa59fa4e309d6fab1997
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 3
; SigOutputElements: 3
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 3
; SigOutputVectors[0]: 3
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !37)
!1 = !DIFile(filename: "Shaders\5CSpriteVertexShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 19, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 19, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 19, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 19, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 23, type: !18, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !32}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 16, size: 320, align: 32, elements: !21)
!21 = !{!22, !23, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 18, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !20, file: !1, line: 19, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !20, file: !1, line: 20, baseType: !25, size: 64, align: 32, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 67, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 67, size: 64, align: 32, elements: !27, templateParams: !30)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 67, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 67, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!32 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 9, size: 256, align: 32, elements: !33)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !32, file: !1, line: 11, baseType: !25, size: 64, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !32, file: !1, line: 12, baseType: !4, size: 128, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !32, file: !1, line: 13, baseType: !25, size: 64, align: 32, offset: 192)
!37 = !{!38, !41, !42, !44, !45, !46, !50, !51, !62, !86, !87, !108, !109, !110, !111, !112, !113, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129}
!38 = !DIGlobalVariable(name: "GlobalAmbient", linkageName: "\01?GlobalAmbient@SceneConstants@@3V?$vector@M$03@@B", scope: !0, file: !39, line: 19, type: !40, isLocal: false, isDefinition: true)
!39 = !DIFile(filename: "Shaders/PerFrameConstants.hlsli", directory: "")
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!41 = !DIGlobalVariable(name: "FogColor", linkageName: "\01?FogColor@SceneConstants@@3V?$vector@M$03@@B", scope: !0, file: !39, line: 20, type: !40, isLocal: false, isDefinition: true)
!42 = !DIGlobalVariable(name: "FogStart", linkageName: "\01?FogStart@SceneConstants@@3MB", scope: !0, file: !39, line: 21, type: !43, isLocal: false, isDefinition: true)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!44 = !DIGlobalVariable(name: "FogEnd", linkageName: "\01?FogEnd@SceneConstants@@3MB", scope: !0, file: !39, line: 22, type: !43, isLocal: false, isDefinition: true)
!45 = !DIGlobalVariable(name: "FogDensity", linkageName: "\01?FogDensity@SceneConstants@@3MB", scope: !0, file: !39, line: 23, type: !43, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariable(name: "FogMode", linkageName: "\01?FogMode@SceneConstants@@3IB", scope: !0, file: !39, line: 24, type: !47, isLocal: false, isDefinition: true)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 24, baseType: !49)
!49 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!50 = !DIGlobalVariable(name: "FadeAlpha", linkageName: "\01?FadeAlpha@SceneConstants@@3MB", scope: !0, file: !39, line: 25, type: !43, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariable(name: "_scenePad", linkageName: "\01?_scenePad@SceneConstants@@3V?$vector@I$02@@B", scope: !0, file: !39, line: 26, type: !52, isLocal: false, isDefinition: true)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 26, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 26, size: 96, align: 32, elements: !55, templateParams: !59)
!55 = !{!56, !57, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !54, file: !1, line: 26, baseType: !49, size: 32, align: 32, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !54, file: !1, line: 26, baseType: !49, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !54, file: !1, line: 26, baseType: !49, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!59 = !{!60, !61}
!60 = !DITemplateTypeParameter(name: "element", type: !49)
!61 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!62 = !DIGlobalVariable(name: "WorldMatrix", linkageName: "\01?WorldMatrix@DrawConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !39, line: 32, type: !63, isLocal: false, isDefinition: true)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 32, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 32, size: 512, align: 32, elements: !66, templateParams: !83)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !65, file: !1, line: 32, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!83 = !{!13, !84, !85}
!84 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!85 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!86 = !DIGlobalVariable(name: "ProjectionMatrix", linkageName: "\01?ProjectionMatrix@DrawConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !39, line: 33, type: !63, isLocal: false, isDefinition: true)
!87 = !DIGlobalVariable(name: "Lights", linkageName: "\01?Lights@DrawConstants@@3QBULightData@@B", scope: !0, file: !39, line: 35, type: !88, isLocal: false, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 6144, align: 32, elements: !106)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "LightData", file: !39, line: 5, size: 768, align: 32, elements: !91)
!91 = !{!92, !93, !94, !95, !96, !97, !98}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !90, file: !39, line: 7, baseType: !4, size: 128, align: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !90, file: !39, line: 8, baseType: !4, size: 128, align: 32, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !90, file: !39, line: 9, baseType: !4, size: 128, align: 32, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !90, file: !39, line: 10, baseType: !4, size: 128, align: 32, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !90, file: !39, line: 11, baseType: !4, size: 128, align: 32, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", scope: !90, file: !39, line: 12, baseType: !48, size: 32, align: 32, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !90, file: !39, line: 13, baseType: !99, size: 96, align: 32, offset: 672)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 35, baseType: !100)
!100 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 35, size: 96, align: 32, elements: !101, templateParams: !105)
!101 = !{!102, !103, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !100, file: !1, line: 35, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !100, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !100, file: !1, line: 35, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!105 = !{!13, !61}
!106 = !{!107}
!107 = !DISubrange(count: 8)
!108 = !DIGlobalVariable(name: "MatAmbient", linkageName: "\01?MatAmbient@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !39, line: 38, type: !40, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariable(name: "MatDiffuse", linkageName: "\01?MatDiffuse@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !39, line: 39, type: !40, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariable(name: "MatSpecular", linkageName: "\01?MatSpecular@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !39, line: 40, type: !40, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariable(name: "MatEmissive", linkageName: "\01?MatEmissive@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !39, line: 41, type: !40, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariable(name: "MatShininess", linkageName: "\01?MatShininess@DrawConstants@@3MB", scope: !0, file: !39, line: 42, type: !43, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariable(name: "_matPad", linkageName: "\01?_matPad@DrawConstants@@3V?$vector@M$02@@B", scope: !0, file: !39, line: 43, type: !114, isLocal: false, isDefinition: true)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!115 = !DIGlobalVariable(name: "LightingEnabled", linkageName: "\01?LightingEnabled@DrawConstants@@3IB", scope: !0, file: !39, line: 45, type: !47, isLocal: false, isDefinition: true)
!116 = !DIGlobalVariable(name: "FogEnabled", linkageName: "\01?FogEnabled@DrawConstants@@3IB", scope: !0, file: !39, line: 46, type: !47, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariable(name: "TexturingEnabled0", linkageName: "\01?TexturingEnabled0@DrawConstants@@3IB", scope: !0, file: !39, line: 47, type: !47, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariable(name: "TexturingEnabled1", linkageName: "\01?TexturingEnabled1@DrawConstants@@3IB", scope: !0, file: !39, line: 48, type: !47, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariable(name: "TexEnvMode0", linkageName: "\01?TexEnvMode0@DrawConstants@@3IB", scope: !0, file: !39, line: 51, type: !47, isLocal: false, isDefinition: true)
!120 = !DIGlobalVariable(name: "TexEnvMode1", linkageName: "\01?TexEnvMode1@DrawConstants@@3IB", scope: !0, file: !39, line: 52, type: !47, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariable(name: "ColorMaterialEnabled", linkageName: "\01?ColorMaterialEnabled@DrawConstants@@3IB", scope: !0, file: !39, line: 55, type: !47, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariable(name: "ColorMaterialMode", linkageName: "\01?ColorMaterialMode@DrawConstants@@3IB", scope: !0, file: !39, line: 56, type: !47, isLocal: false, isDefinition: true)
!123 = !DIGlobalVariable(name: "AlphaTestEnabled", linkageName: "\01?AlphaTestEnabled@DrawConstants@@3IB", scope: !0, file: !39, line: 59, type: !47, isLocal: false, isDefinition: true)
!124 = !DIGlobalVariable(name: "AlphaTestFunc", linkageName: "\01?AlphaTestFunc@DrawConstants@@3IB", scope: !0, file: !39, line: 60, type: !47, isLocal: false, isDefinition: true)
!125 = !DIGlobalVariable(name: "AlphaTestRef", linkageName: "\01?AlphaTestRef@DrawConstants@@3MB", scope: !0, file: !39, line: 61, type: !43, isLocal: false, isDefinition: true)
!126 = !DIGlobalVariable(name: "NormalizeNormals", linkageName: "\01?NormalizeNormals@DrawConstants@@3IB", scope: !0, file: !39, line: 64, type: !47, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariable(name: "FlatShading", linkageName: "\01?FlatShading@DrawConstants@@3IB", scope: !0, file: !39, line: 65, type: !47, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariable(name: "PointSize", linkageName: "\01?PointSize@DrawConstants@@3MB", scope: !0, file: !39, line: 66, type: !43, isLocal: false, isDefinition: true)
