#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; TEXCOORD                 1     z         2     NONE   float     z 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 64e8532475f70856dfd89fa763b11e62.pdb
; shader hash: 64e8532475f70856dfd89fa763b11e62
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 4
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 3
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !32)
!1 = !DIFile(filename: "Shaders\5CTreePixelShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "main", scope: !1, file: !1, line: 14, type: !5, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DISubroutineType(types: !6)
!6 = !{!7, !19}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 20, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 20, size: 128, align: 32, elements: !9, templateParams: !15)
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, line: 20, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, line: 20, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !8, file: !1, line: 20, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !8, file: !1, line: 20, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!15 = !{!16, !17}
!16 = !DITemplateTypeParameter(name: "element", type: !11)
!17 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 4)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 6, size: 352, align: 32, elements: !20)
!20 = !{!21, !22, !23, !31}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !19, file: !1, line: 8, baseType: !7, size: 128, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !19, file: !1, line: 9, baseType: !7, size: 128, align: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !19, file: !1, line: 10, baseType: !24, size: 64, align: 32, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 61, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 61, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 61, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 61, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!16, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 2)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "FogDist", scope: !19, file: !1, line: 11, baseType: !11, size: 32, align: 32, offset: 320)
!32 = !{!33, !58, !59, !83, !85, !86, !87, !88, !90, !92, !93, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !118}
!33 = !DIGlobalVariable(name: "WorldMatrix", linkageName: "\01?WorldMatrix@PerFrameConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !34, line: 6, type: !35, isLocal: false, isDefinition: true)
!34 = !DIFile(filename: "Shaders/PerFrameConstants.hlsli", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 6, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 6, size: 512, align: 32, elements: !38, templateParams: !55)
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !37, file: !1, line: 6, baseType: !11, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!55 = !{!16, !56, !57}
!56 = !DITemplateValueParameter(name: "row_count", type: !18, value: i32 4)
!57 = !DITemplateValueParameter(name: "col_count", type: !18, value: i32 4)
!58 = !DIGlobalVariable(name: "ProjectionMatrix", linkageName: "\01?ProjectionMatrix@PerFrameConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !34, line: 7, type: !35, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariable(name: "Lights", linkageName: "\01?Lights@PerFrameConstants@@3QBULightData@1@B", scope: !0, file: !34, line: 20, type: !60, isLocal: false, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 6144, align: 32, elements: !81)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "LightData", file: !34, line: 10, size: 768, align: 32, elements: !63)
!63 = !{!64, !65, !66, !67, !68, !69, !72}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !62, file: !34, line: 12, baseType: !7, size: 128, align: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !62, file: !34, line: 13, baseType: !7, size: 128, align: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !62, file: !34, line: 14, baseType: !7, size: 128, align: 32, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !62, file: !34, line: 15, baseType: !7, size: 128, align: 32, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !62, file: !34, line: 16, baseType: !7, size: 128, align: 32, offset: 512)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", scope: !62, file: !34, line: 17, baseType: !70, size: 32, align: 32, offset: 640)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 20, baseType: !71)
!71 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !62, file: !34, line: 18, baseType: !73, size: 96, align: 32, offset: 672)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 20, baseType: !74)
!74 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 20, size: 96, align: 32, elements: !75, templateParams: !79)
!75 = !{!76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !74, file: !1, line: 20, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !74, file: !1, line: 20, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !74, file: !1, line: 20, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!79 = !{!16, !80}
!80 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 3)
!81 = !{!82}
!82 = !DISubrange(count: 8)
!83 = !DIGlobalVariable(name: "MatAmbient", linkageName: "\01?MatAmbient@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !34, line: 23, type: !84, isLocal: false, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!85 = !DIGlobalVariable(name: "MatDiffuse", linkageName: "\01?MatDiffuse@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !34, line: 24, type: !84, isLocal: false, isDefinition: true)
!86 = !DIGlobalVariable(name: "MatSpecular", linkageName: "\01?MatSpecular@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !34, line: 25, type: !84, isLocal: false, isDefinition: true)
!87 = !DIGlobalVariable(name: "MatEmissive", linkageName: "\01?MatEmissive@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !34, line: 26, type: !84, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariable(name: "MatShininess", linkageName: "\01?MatShininess@PerFrameConstants@@3MB", scope: !0, file: !34, line: 27, type: !89, isLocal: false, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!90 = !DIGlobalVariable(name: "_matPad", linkageName: "\01?_matPad@PerFrameConstants@@3V?$vector@M$02@@B", scope: !0, file: !34, line: 28, type: !91, isLocal: false, isDefinition: true)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!92 = !DIGlobalVariable(name: "GlobalAmbient", linkageName: "\01?GlobalAmbient@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !34, line: 31, type: !84, isLocal: false, isDefinition: true)
!93 = !DIGlobalVariable(name: "LightingEnabled", linkageName: "\01?LightingEnabled@PerFrameConstants@@3IB", scope: !0, file: !34, line: 32, type: !94, isLocal: false, isDefinition: true)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!95 = !DIGlobalVariable(name: "FogEnabled", linkageName: "\01?FogEnabled@PerFrameConstants@@3IB", scope: !0, file: !34, line: 33, type: !94, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariable(name: "TexturingEnabled0", linkageName: "\01?TexturingEnabled0@PerFrameConstants@@3IB", scope: !0, file: !34, line: 34, type: !94, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariable(name: "TexturingEnabled1", linkageName: "\01?TexturingEnabled1@PerFrameConstants@@3IB", scope: !0, file: !34, line: 35, type: !94, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariable(name: "FogColor", linkageName: "\01?FogColor@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !34, line: 38, type: !84, isLocal: false, isDefinition: true)
!99 = !DIGlobalVariable(name: "FogStart", linkageName: "\01?FogStart@PerFrameConstants@@3MB", scope: !0, file: !34, line: 39, type: !89, isLocal: false, isDefinition: true)
!100 = !DIGlobalVariable(name: "FogEnd", linkageName: "\01?FogEnd@PerFrameConstants@@3MB", scope: !0, file: !34, line: 40, type: !89, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariable(name: "FogDensity", linkageName: "\01?FogDensity@PerFrameConstants@@3MB", scope: !0, file: !34, line: 41, type: !89, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariable(name: "FogMode", linkageName: "\01?FogMode@PerFrameConstants@@3IB", scope: !0, file: !34, line: 42, type: !94, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariable(name: "TexEnvMode0", linkageName: "\01?TexEnvMode0@PerFrameConstants@@3IB", scope: !0, file: !34, line: 45, type: !94, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "TexEnvMode1", linkageName: "\01?TexEnvMode1@PerFrameConstants@@3IB", scope: !0, file: !34, line: 46, type: !94, isLocal: false, isDefinition: true)
