#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; TEXCOORD                 0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; TEXCOORD                 1     z         2     NONE   float     z 
;
; shader debug name: 6932e99d0a19b9899251e8d95f70746f.pdb
; shader hash: 6932e99d0a19b9899251e8d95f70746f
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 2
; SigOutputElements: 4
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 2
; SigOutputVectors[0]: 3
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !45)
!1 = !DIFile(filename: "Shaders\5CTreeVertexShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 20, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 20, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 17, type: !18, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !33}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 9, size: 352, align: 32, elements: !21)
!21 = !{!22, !23, !24, !32}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !20, file: !1, line: 11, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !20, file: !1, line: 12, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !20, file: !1, line: 13, baseType: !25, size: 64, align: 32, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 61, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 61, size: 64, align: 32, elements: !27, templateParams: !30)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 61, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "FogDist", scope: !20, file: !1, line: 14, baseType: !8, size: 32, align: 32, offset: 320)
!33 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 3, size: 160, align: 32, elements: !34)
!34 = !{!35, !44}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !33, file: !1, line: 5, baseType: !36, size: 96, align: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 20, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 20, size: 96, align: 32, elements: !38, templateParams: !42)
!38 = !{!39, !40, !41}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !1, line: 20, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !37, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !37, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !{!13, !43}
!43 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !33, file: !1, line: 6, baseType: !25, size: 64, align: 32, offset: 96)
!45 = !{!46, !71, !72, !88, !90, !91, !92, !93, !95, !97, !98, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!46 = !DIGlobalVariable(name: "WorldMatrix", linkageName: "\01?WorldMatrix@PerFrameConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !47, line: 6, type: !48, isLocal: false, isDefinition: true)
!47 = !DIFile(filename: "Shaders/PerFrameConstants.hlsli", directory: "")
!48 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 6, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 6, size: 512, align: 32, elements: !51, templateParams: !68)
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !50, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!68 = !{!13, !69, !70}
!69 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!70 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!71 = !DIGlobalVariable(name: "ProjectionMatrix", linkageName: "\01?ProjectionMatrix@PerFrameConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !47, line: 7, type: !48, isLocal: false, isDefinition: true)
!72 = !DIGlobalVariable(name: "Lights", linkageName: "\01?Lights@PerFrameConstants@@3QBULightData@1@B", scope: !0, file: !47, line: 20, type: !73, isLocal: false, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 6144, align: 32, elements: !86)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "LightData", file: !47, line: 10, size: 768, align: 32, elements: !76)
!76 = !{!77, !78, !79, !80, !81, !82, !85}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !75, file: !47, line: 12, baseType: !4, size: 128, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !75, file: !47, line: 13, baseType: !4, size: 128, align: 32, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !75, file: !47, line: 14, baseType: !4, size: 128, align: 32, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !75, file: !47, line: 15, baseType: !4, size: 128, align: 32, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !75, file: !47, line: 16, baseType: !4, size: 128, align: 32, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", scope: !75, file: !47, line: 17, baseType: !83, size: 32, align: 32, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 20, baseType: !84)
!84 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !75, file: !47, line: 18, baseType: !36, size: 96, align: 32, offset: 672)
!86 = !{!87}
!87 = !DISubrange(count: 8)
!88 = !DIGlobalVariable(name: "MatAmbient", linkageName: "\01?MatAmbient@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !47, line: 23, type: !89, isLocal: false, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!90 = !DIGlobalVariable(name: "MatDiffuse", linkageName: "\01?MatDiffuse@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !47, line: 24, type: !89, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariable(name: "MatSpecular", linkageName: "\01?MatSpecular@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !47, line: 25, type: !89, isLocal: false, isDefinition: true)
!92 = !DIGlobalVariable(name: "MatEmissive", linkageName: "\01?MatEmissive@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !47, line: 26, type: !89, isLocal: false, isDefinition: true)
!93 = !DIGlobalVariable(name: "MatShininess", linkageName: "\01?MatShininess@PerFrameConstants@@3MB", scope: !0, file: !47, line: 27, type: !94, isLocal: false, isDefinition: true)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!95 = !DIGlobalVariable(name: "_matPad", linkageName: "\01?_matPad@PerFrameConstants@@3V?$vector@M$02@@B", scope: !0, file: !47, line: 28, type: !96, isLocal: false, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!97 = !DIGlobalVariable(name: "GlobalAmbient", linkageName: "\01?GlobalAmbient@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !47, line: 31, type: !89, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariable(name: "LightingEnabled", linkageName: "\01?LightingEnabled@PerFrameConstants@@3IB", scope: !0, file: !47, line: 32, type: !99, isLocal: false, isDefinition: true)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!100 = !DIGlobalVariable(name: "FogEnabled", linkageName: "\01?FogEnabled@PerFrameConstants@@3IB", scope: !0, file: !47, line: 33, type: !99, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariable(name: "TexturingEnabled0", linkageName: "\01?TexturingEnabled0@PerFrameConstants@@3IB", scope: !0, file: !47, line: 34, type: !99, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariable(name: "TexturingEnabled1", linkageName: "\01?TexturingEnabled1@PerFrameConstants@@3IB", scope: !0, file: !47, line: 35, type: !99, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariable(name: "FogColor", linkageName: "\01?FogColor@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !47, line: 38, type: !89, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "FogStart", linkageName: "\01?FogStart@PerFrameConstants@@3MB", scope: !0, file: !47, line: 39, type: !94, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariable(name: "FogEnd", linkageName: "\01?FogEnd@PerFrameConstants@@3MB", scope: !0, file: !47, line: 40, type: !94, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariable(name: "FogDensity", linkageName: "\01?FogDensity@PerFrameConstants@@3MB", scope: !0, file: !47, line: 41, type: !94, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariable(name: "FogMode", linkageName: "\01?FogMode@PerFrameConstants@@3IB", scope: !0, file: !47, line: 42, type: !99, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariable(name: "TexEnvMode0", linkageName: "\01?TexEnvMode0@PerFrameConstants@@3IB", scope: !0, file: !47, line: 45, type: !99, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariable(name: "TexEnvMode1", linkageName: "\01?TexEnvMode1@PerFrameConstants@@3IB", scope: !0, file: !47, line: 46, type: !99, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariable(name: "ColorMaterialEnabled", linkageName: "\01?ColorMaterialEnabled@PerFrameConstants@@3IB", scope: !0, file: !47, line: 49, type: !99, isLocal: false, isDefinition: true)
