#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; TEXCOORD                 1     z         2     NONE   float     z 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 4bf1e09f8587cef13549c89854fe4b44.pdb
; shader hash: 4bf1e09f8587cef13549c89854fe4b44
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 4
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 3
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !32)
!1 = !DIFile(filename: "Shaders\5CTreePixelShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "main", scope: !1, file: !1, line: 14, type: !5, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DISubroutineType(types: !6)
!6 = !{!7, !19}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 20, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 20, size: 128, align: 32, elements: !9, templateParams: !15)
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, line: 20, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, line: 20, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !8, file: !1, line: 20, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !8, file: !1, line: 20, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!15 = !{!16, !17}
!16 = !DITemplateTypeParameter(name: "element", type: !11)
!17 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 4)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 6, size: 352, align: 32, elements: !20)
!20 = !{!21, !22, !23, !31}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !19, file: !1, line: 8, baseType: !7, size: 128, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !19, file: !1, line: 9, baseType: !7, size: 128, align: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord", scope: !19, file: !1, line: 10, baseType: !24, size: 64, align: 32, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 68, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 68, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 68, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 68, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!16, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 2)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "FogDist", scope: !19, file: !1, line: 11, baseType: !11, size: 32, align: 32, offset: 320)
!32 = !{!33, !36, !37, !39, !40, !41, !45, !46, !57, !81, !82, !103, !104, !105, !106, !107, !108, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !129}
!33 = !DIGlobalVariable(name: "GlobalAmbient", linkageName: "\01?GlobalAmbient@SceneConstants@@3V?$vector@M$03@@B", scope: !0, file: !34, line: 20, type: !35, isLocal: false, isDefinition: true)
!34 = !DIFile(filename: "Shaders/PerFrameConstants.hlsli", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!36 = !DIGlobalVariable(name: "FogColor", linkageName: "\01?FogColor@SceneConstants@@3V?$vector@M$03@@B", scope: !0, file: !34, line: 21, type: !35, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariable(name: "FogStart", linkageName: "\01?FogStart@SceneConstants@@3MB", scope: !0, file: !34, line: 22, type: !38, isLocal: false, isDefinition: true)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!39 = !DIGlobalVariable(name: "FogEnd", linkageName: "\01?FogEnd@SceneConstants@@3MB", scope: !0, file: !34, line: 23, type: !38, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariable(name: "FogDensity", linkageName: "\01?FogDensity@SceneConstants@@3MB", scope: !0, file: !34, line: 24, type: !38, isLocal: false, isDefinition: true)
!41 = !DIGlobalVariable(name: "FogMode", linkageName: "\01?FogMode@SceneConstants@@3IB", scope: !0, file: !34, line: 25, type: !42, isLocal: false, isDefinition: true)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 25, baseType: !44)
!44 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!45 = !DIGlobalVariable(name: "FadeAlpha", linkageName: "\01?FadeAlpha@SceneConstants@@3MB", scope: !0, file: !34, line: 26, type: !38, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariable(name: "_scenePad", linkageName: "\01?_scenePad@SceneConstants@@3V?$vector@I$02@@B", scope: !0, file: !34, line: 27, type: !47, isLocal: false, isDefinition: true)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 27, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 27, size: 96, align: 32, elements: !50, templateParams: !54)
!50 = !{!51, !52, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !49, file: !1, line: 27, baseType: !44, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !49, file: !1, line: 27, baseType: !44, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !49, file: !1, line: 27, baseType: !44, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!54 = !{!55, !56}
!55 = !DITemplateTypeParameter(name: "element", type: !44)
!56 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 3)
!57 = !DIGlobalVariable(name: "WorldMatrix", linkageName: "\01?WorldMatrix@DrawConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !34, line: 33, type: !58, isLocal: false, isDefinition: true)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 33, baseType: !60)
!60 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 33, size: 512, align: 32, elements: !61, templateParams: !78)
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !60, file: !1, line: 33, baseType: !11, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!78 = !{!16, !79, !80}
!79 = !DITemplateValueParameter(name: "row_count", type: !18, value: i32 4)
!80 = !DITemplateValueParameter(name: "col_count", type: !18, value: i32 4)
!81 = !DIGlobalVariable(name: "ProjectionMatrix", linkageName: "\01?ProjectionMatrix@DrawConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !34, line: 34, type: !58, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariable(name: "Lights", linkageName: "\01?Lights@DrawConstants@@3QBULightData@@B", scope: !0, file: !34, line: 36, type: !83, isLocal: false, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 6144, align: 32, elements: !101)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !85)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "LightData", file: !34, line: 6, size: 768, align: 32, elements: !86)
!86 = !{!87, !88, !89, !90, !91, !92, !93}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !85, file: !34, line: 8, baseType: !7, size: 128, align: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !85, file: !34, line: 9, baseType: !7, size: 128, align: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !85, file: !34, line: 10, baseType: !7, size: 128, align: 32, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !85, file: !34, line: 11, baseType: !7, size: 128, align: 32, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !85, file: !34, line: 12, baseType: !7, size: 128, align: 32, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", scope: !85, file: !34, line: 13, baseType: !43, size: 32, align: 32, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !85, file: !34, line: 14, baseType: !94, size: 96, align: 32, offset: 672)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 36, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 36, size: 96, align: 32, elements: !96, templateParams: !100)
!96 = !{!97, !98, !99}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !95, file: !1, line: 36, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !95, file: !1, line: 36, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !95, file: !1, line: 36, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!100 = !{!16, !56}
!101 = !{!102}
!102 = !DISubrange(count: 8)
!103 = !DIGlobalVariable(name: "MatAmbient", linkageName: "\01?MatAmbient@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !34, line: 39, type: !35, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "MatDiffuse", linkageName: "\01?MatDiffuse@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !34, line: 40, type: !35, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariable(name: "MatSpecular", linkageName: "\01?MatSpecular@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !34, line: 41, type: !35, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariable(name: "MatEmissive", linkageName: "\01?MatEmissive@DrawConstants@@3V?$vector@M$03@@B", scope: !0, file: !34, line: 42, type: !35, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariable(name: "MatShininess", linkageName: "\01?MatShininess@DrawConstants@@3MB", scope: !0, file: !34, line: 43, type: !38, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariable(name: "_matPad", linkageName: "\01?_matPad@DrawConstants@@3V?$vector@M$02@@B", scope: !0, file: !34, line: 44, type: !109, isLocal: false, isDefinition: true)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!110 = !DIGlobalVariable(name: "LightingEnabled", linkageName: "\01?LightingEnabled@DrawConstants@@3IB", scope: !0, file: !34, line: 46, type: !42, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariable(name: "FogEnabled", linkageName: "\01?FogEnabled@DrawConstants@@3IB", scope: !0, file: !34, line: 47, type: !42, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariable(name: "TexturingEnabled0", linkageName: "\01?TexturingEnabled0@DrawConstants@@3IB", scope: !0, file: !34, line: 48, type: !42, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariable(name: "TexturingEnabled1", linkageName: "\01?TexturingEnabled1@DrawConstants@@3IB", scope: !0, file: !34, line: 49, type: !42, isLocal: false, isDefinition: true)
!114 = !DIGlobalVariable(name: "TexEnvMode0", linkageName: "\01?TexEnvMode0@DrawConstants@@3IB", scope: !0, file: !34, line: 52, type: !42, isLocal: false, isDefinition: true)
!115 = !DIGlobalVariable(name: "TexEnvMode1", linkageName: "\01?TexEnvMode1@DrawConstants@@3IB", scope: !0, file: !34, line: 53, type: !42, isLocal: false, isDefinition: true)
!116 = !DIGlobalVariable(name: "ColorMaterialEnabled", linkageName: "\01?ColorMaterialEnabled@DrawConstants@@3IB", scope: !0, file: !34, line: 56, type: !42, isLocal: false, isDefinition: true)
!117 = !DIGlobalVariable(name: "ColorMaterialMode", linkageName: "\01?ColorMaterialMode@DrawConstants@@3IB", scope: !0, file: !34, line: 57, type: !42, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariable(name: "AlphaTestEnabled", linkageName: "\01?AlphaTestEnabled@DrawConstants@@3IB", scope: !0, file: !34, line: 60, type: !42, isLocal: false, isDefinition: true)
!119 = !DIGlobalVariable(name: "AlphaTestFunc", linkageName: "\01?AlphaTestFunc@DrawConstants@@3IB", scope: !0, file: !34, line: 61, type: !42, isLocal: false, isDefinition: true)
!120 = !DIGlobalVariable(name: "AlphaTestRef", linkageName: "\01?AlphaTestRef@DrawConstants@@3MB", scope: !0, file: !34, line: 62, type: !38, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariable(name: "NormalizeNormals", linkageName: "\01?NormalizeNormals@DrawConstants@@3IB", scope: !0, file: !34, line: 65, type: !42, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariable(name: "FlatShading", linkageName: "\01?FlatShading@DrawConstants@@3IB", scope: !0, file: !34, line: 66, type: !42, isLocal: false, isDefinition: true)
!123 = !DIGlobalVariable(name: "PointSize", linkageName: "\01?PointSize@DrawConstants@@3MB", scope: !0, file: !34, line: 67, type: !38, isLocal: false, isDefinition: true)
