#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; NORMAL                   0   xyz         1     NONE   float   xyz 
; COLOR                    0   xyzw        2     NONE   float   xyzw
; TEXCOORD                 0   xy          3     NONE   float   xy  
; TEXCOORD                 1   xy          4     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
; TEXCOORD                 0   xy          2     NONE   float   xy  
; TEXCOORD                 1     zw        2     NONE   float     zw
; TEXCOORD                 2   x           3     NONE   float   x   
; TEXCOORD                 3    yzw        3     NONE   float    yzw
;
; shader debug name: 043c7f382111950efb95616867275bb8.pdb
; shader hash: 043c7f382111950efb95616867275bb8
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 5
; SigOutputElements: 6
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 5

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2502.11 (239921522)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !39, globals: !65)
!1 = !DIFile(filename: "Shaders\5CVertexShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !31}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 20, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 20, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 50, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 50, size: 288, align: 32, elements: !18, templateParams: !28)
!18 = !{!19, !20, !21, !22, !23, !24, !25, !26, !27}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !17, file: !1, line: 50, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !17, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !17, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !17, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !17, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !17, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !17, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !17, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !17, file: !1, line: 50, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!28 = !{!13, !29, !30}
!29 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!30 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 20, baseType: !32)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 20, size: 96, align: 32, elements: !33, templateParams: !37)
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !32, file: !1, line: 20, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !32, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !32, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!37 = !{!13, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!39 = !{!40}
!40 = !DISubprogram(name: "main", scope: !1, file: !1, line: 24, type: !41, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !58}
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSOutput", file: !1, line: 14, size: 512, align: 32, elements: !44)
!44 = !{!45, !46, !47, !55, !56, !57}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !43, file: !1, line: 16, baseType: !4, size: 128, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !43, file: !1, line: 17, baseType: !4, size: 128, align: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord0", scope: !43, file: !1, line: 18, baseType: !48, size: 64, align: 32, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 61, baseType: !49)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 61, size: 64, align: 32, elements: !50, templateParams: !53)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !49, file: !1, line: 61, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !49, file: !1, line: 61, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!53 = !{!13, !54}
!54 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord1", scope: !43, file: !1, line: 19, baseType: !48, size: 64, align: 32, offset: 320)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "FogDist", scope: !43, file: !1, line: 20, baseType: !8, size: 32, align: 32, offset: 384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "WorldPos", scope: !43, file: !1, line: 21, baseType: !31, size: 96, align: 32, offset: 416)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "VSInput", file: !1, line: 5, size: 448, align: 32, elements: !59)
!59 = !{!60, !61, !62, !63, !64}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !58, file: !1, line: 7, baseType: !31, size: 96, align: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Normal", scope: !58, file: !1, line: 8, baseType: !31, size: 96, align: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "Color", scope: !58, file: !1, line: 9, baseType: !4, size: 128, align: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord0", scope: !58, file: !1, line: 10, baseType: !48, size: 64, align: 32, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "TexCoord1", scope: !58, file: !1, line: 11, baseType: !48, size: 64, align: 32, offset: 384)
!65 = !{!66, !91, !92, !108, !110, !111, !112, !113, !115, !117, !118, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138}
!66 = !DIGlobalVariable(name: "WorldMatrix", linkageName: "\01?WorldMatrix@PerFrameConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !67, line: 6, type: !68, isLocal: false, isDefinition: true)
!67 = !DIFile(filename: "Shaders/PerFrameConstants.hlsli", directory: "")
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 6, baseType: !70)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 6, size: 512, align: 32, elements: !71, templateParams: !88)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !70, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!88 = !{!13, !89, !90}
!89 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!90 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!91 = !DIGlobalVariable(name: "ProjectionMatrix", linkageName: "\01?ProjectionMatrix@PerFrameConstants@@3V?$matrix@M$03$03@@B", scope: !0, file: !67, line: 7, type: !68, isLocal: false, isDefinition: true)
!92 = !DIGlobalVariable(name: "Lights", linkageName: "\01?Lights@PerFrameConstants@@3QBULightData@1@B", scope: !0, file: !67, line: 20, type: !93, isLocal: false, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 6144, align: 32, elements: !106)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "LightData", file: !67, line: 10, size: 768, align: 32, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !105}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "Position", scope: !95, file: !67, line: 12, baseType: !4, size: 128, align: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !95, file: !67, line: 13, baseType: !4, size: 128, align: 32, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "Diffuse", scope: !95, file: !67, line: 14, baseType: !4, size: 128, align: 32, offset: 256)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Specular", scope: !95, file: !67, line: 15, baseType: !4, size: 128, align: 32, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Ambient", scope: !95, file: !67, line: 16, baseType: !4, size: 128, align: 32, offset: 512)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Enabled", scope: !95, file: !67, line: 17, baseType: !103, size: 32, align: 32, offset: 640)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 20, baseType: !104)
!104 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !95, file: !67, line: 18, baseType: !31, size: 96, align: 32, offset: 672)
!106 = !{!107}
!107 = !DISubrange(count: 8)
!108 = !DIGlobalVariable(name: "MatAmbient", linkageName: "\01?MatAmbient@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !67, line: 23, type: !109, isLocal: false, isDefinition: true)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!110 = !DIGlobalVariable(name: "MatDiffuse", linkageName: "\01?MatDiffuse@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !67, line: 24, type: !109, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariable(name: "MatSpecular", linkageName: "\01?MatSpecular@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !67, line: 25, type: !109, isLocal: false, isDefinition: true)
!112 = !DIGlobalVariable(name: "MatEmissive", linkageName: "\01?MatEmissive@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !67, line: 26, type: !109, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariable(name: "MatShininess", linkageName: "\01?MatShininess@PerFrameConstants@@3MB", scope: !0, file: !67, line: 27, type: !114, isLocal: false, isDefinition: true)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!115 = !DIGlobalVariable(name: "_matPad", linkageName: "\01?_matPad@PerFrameConstants@@3V?$vector@M$02@@B", scope: !0, file: !67, line: 28, type: !116, isLocal: false, isDefinition: true)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!117 = !DIGlobalVariable(name: "GlobalAmbient", linkageName: "\01?GlobalAmbient@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !67, line: 31, type: !109, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariable(name: "LightingEnabled", linkageName: "\01?LightingEnabled@PerFrameConstants@@3IB", scope: !0, file: !67, line: 32, type: !119, isLocal: false, isDefinition: true)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!120 = !DIGlobalVariable(name: "FogEnabled", linkageName: "\01?FogEnabled@PerFrameConstants@@3IB", scope: !0, file: !67, line: 33, type: !119, isLocal: false, isDefinition: true)
!121 = !DIGlobalVariable(name: "TexturingEnabled0", linkageName: "\01?TexturingEnabled0@PerFrameConstants@@3IB", scope: !0, file: !67, line: 34, type: !119, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariable(name: "TexturingEnabled1", linkageName: "\01?TexturingEnabled1@PerFrameConstants@@3IB", scope: !0, file: !67, line: 35, type: !119, isLocal: false, isDefinition: true)
!123 = !DIGlobalVariable(name: "FogColor", linkageName: "\01?FogColor@PerFrameConstants@@3V?$vector@M$03@@B", scope: !0, file: !67, line: 38, type: !109, isLocal: false, isDefinition: true)
!124 = !DIGlobalVariable(name: "FogStart", linkageName: "\01?FogStart@PerFrameConstants@@3MB", scope: !0, file: !67, line: 39, type: !114, isLocal: false, isDefinition: true)
!125 = !DIGlobalVariable(name: "FogEnd", linkageName: "\01?FogEnd@PerFrameConstants@@3MB", scope: !0, file: !67, line: 40, type: !114, isLocal: false, isDefinition: true)
!126 = !DIGlobalVariable(name: "FogDensity", linkageName: "\01?FogDensity@PerFrameConstants@@3MB", scope: !0, file: !67, line: 41, type: !114, isLocal: false, isDefinition: true)
!127 = !DIGlobalVariable(name: "FogMode", linkageName: "\01?FogMode@PerFrameConstants@@3IB", scope: !0, file: !67, line: 42, type: !119, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariable(name: "TexEnvMode0", linkageName: "\01?TexEnvMode0@PerFrameConstants@@3IB", scope: !0, file: !67, line: 45, type: !119, isLocal: false, isDefinition: true)
!129 = !DIGlobalVariable(name: "TexEnvMode1", linkageName: "\01?TexEnvMode1@PerFrameConstants@@3IB", scope: !0, file: !67, line: 46, type: !119, isLocal: false, isDefinition: true)
!130 = !DIGlobalVariable(name: "ColorMaterialEnabled", linkageName: "\01?ColorMaterialEnabled@PerFrameConstants@@3IB", scope: !0, file: !67, line: 49, type: !119, isLocal: false, isDefinition: true)
